iNavFlight/inav/lib/main/STM32H7/Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_sdio.c
/**
  ******************************************************************************
  * @file    stm32h7xx_hal_sdio.c
  * @author  MCD Application Team
  * @brief   SDIO HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Secure Digital Input Output (SDIO) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
    This driver implements a high level communication layer for read and write from/to
    this SDIO card. The needed STM32 hardware resources (SDMMC and GPIO) are performed by
    the user in HAL_SDIO_MspInit() function (MSP layer).
    Basically, the MSP layer configuration should be the same as we provide in the
    examples.
    You can easily tailor this configuration according to hardware resources.

  [..]
    This driver is a generic layered driver for SDMMC memories which uses the HAL
    SDMMC driver functions to interface with SDIO cards devices.
    It is used as follows:

    (#)Initialize the SDMMC low level resources by implementing the HAL_SDIO_MspInit() API:
        (##) Enable the SDMMC interface clock using __HAL_RCC_SDMMC_CLK_ENABLE();
        (##) SDMMC pins configuration for SDIO card
            (+++) Enable the clock for the SDMMC GPIOs using the functions __HAL_RCC_GPIOx_CLK_ENABLE();
            (+++) Configure these SDMMC pins as alternate function pull-up using HAL_GPIO_Init()
                  and according to your pin assignment;
        (##) NVIC configuration if you need to use interrupt process (HAL_SDIO_ReadExtended_DMA()
             and HAL_SDIO_WriteExtended_DMA() APIs).
            (+++) Configure the SDMMC interrupt priorities using function HAL_NVIC_SetPriority();
            (+++) Enable the NVIC SDMMC IRQs using function HAL_NVIC_EnableIRQ()
            (+++) SDMMC interrupts are managed using the macros __HAL_SDIO_ENABLE_IT()
                  and __HAL_SDIO_DISABLE_IT() inside the communication process.
            (+++) SDMMC interrupts pending bits are managed using the macros __HAL_SDIO_GET_IT().
        (##) No general propose DMA Configuration is needed, an Internal DMA for SDMMC Peripheral are used.

    (#) At this stage, you can perform SDIO read/write/erase operations after SDIO card initialization.

  *** SDIO Card Initialization and configuration ***
  ================================================
  [..]
    To initialize the SDIO Card, use the HAL_SDIO_Init() function. It Initializes
    SDMMC Peripheral(STM32 side) and the SDIO Card, and put it into StandBy State (Ready for data transfer).
    This function provide the following operations:

    (#) Apply the SDIO Card initialization process at 400KHz. You can change or adapt this
        frequency by adjusting the "ClockDiv" field.
        The SDIO Card frequency (SDMMC_CK) is computed as follows:

           SDMMC_CK = SDMMCCLK / (2 * ClockDiv)

        In initialization mode and according to the SDIO Card standard,
        make sure that the SDMMC_CK frequency doesn't exceed 400KHz.

        This phase of initialization is done through SDMMC_Init() and
        SDMMC_PowerState_ON() SDMMC low level APIs.

    (#) Initialize the SDIO card. The API used is HAL_SDIO_Init().
        This phase allows the card initialization and identification.

    (#) Configure the SDIO Card Data transfer frequency. You can change or adapt this
        frequency by adjusting the "ClockDiv" field by the API HAL_SDIO_ConfigFrequency().

    (#) Configure the SDIO Card in wide bus mode: 4-bits data by the API HAL_SDIO_SetDataBusWidth().

    (#) Configure the SDIO Card data block size by the API : HAL_SDIO_SetBlockSize().

    (#) Configure the SDIO Card speed mode by the API : HAL_SDIO_SetSpeedMode().

    (#) To custumize the SDIO Init card function for the enumeration card sequence, you can register a user callback
        function by calling the HAL_SDIO_RegisterIdentifyCardCallback before the HAL_SDIO_Init() function.

  *** SDIO Card Read operation ***
  ==============================
  [..]
    (+) You can read from SDIO card in polling mode by using function HAL_SDIO_ReadExtended().
        This function support only 2048-bytes block length (the block size should be
        chosen by using the API HAL_SDIO_SetBlockSize).

    (+) You can read from SDIO card in DMA mode by using function HAL_SDIO_ReadExtended_DMA().
        This function support only 2048-bytes block length (the block size should be
        chosen by using the API HAL_SDIO_SetBlockSize).
        After this, you have to ensure that the transfer is done correctly.
        You could also check the DMA transfer process through the SDIO Rx interrupt event.

  *** SDIO Card Write operation ***
  ===============================
  [..]
    (+) You can write to SDIO card in polling mode by using function HAL_SDIO_WriteExtended().
        This function support only 2048-bytes block length (the block size should be
        chosen by using the API HAL_SDIO_SetBlockSize).

    (+) You can write to SDIO card in DMA mode by using function HAL_SDIO_WriteExtended_DMA().
        This function support only 2048-bytes block length (the block size should be
        chosen by using the API HAL_SDIO_SetBlockSize).
        You could also check the DMA transfer process through the SDIO Tx interrupt event.


  *** SDIO card common control register (CCCR) ***
  ======================
  [..]
    (+) The SDIO CCCR allow for quick host checking and control of an IO card's enable and interrupts on a per card and
        per function basis.
        To get the Card common control registers field, you can use the API HAL_SDIO_GetCardCommonControlRegister().

